Repository: OscarMC/OscarMCTestProjects
Catalog: SnippetEditor/SnippetEditor 2.1/My Project/Resources.*.resx
Languages: de, fr, it

# Attribute_Expected
source: '{0}' attribute is expected for node:
de: Attribut {0} wird für den Knoten erwartet
fr: L'attribut {0} est nécessaire pour le nœud :
it: attributo '{0}' atteso per il nodo:

# Cannot_Find_CodeSnippet
source: Unable to find a snippet in file
de: Snippet-Datei konnte nicht gefunden werden
fr: Impossible de trouver un extrait de code dans le fichier
it: Impossibile trovare uno snippet nel file

# Cannot_Find_CodeSnippets
source: Unable to find the snippets collection in file
de: Snippet-Sammlung konnte nicht in der Datei gefunden werden
fr: Impossible de trouver une collection d'extrait de code dans le fichier
it: Impossibile trovare la collezione di snippet nel file

source: Compiled code:
de: Kompilierter code:
fr: Code compilé :
it: Codice compilato:

# Element_Expected
source: '{0}' element is expected for node:
de: Element '{0}' wird für den Knoten erwartet:
fr: L'élément {0} est nécessaire pour le nœud :
it: Elemento '{0}' atteso per il nodo:

# Error_Loading_Code_Snippet
source: Error while loading the code snippet...
de: Fehler beim Laden des Snippets…
fr: Erreur au chargement de l'extrait de code
it: Errore durante il caricamento dello snippet...

source: Error loading XML file...
de: Fehler beim Laden der XML-Datei…
fr: Erreur au chargement du fichier XML
it: Error durante il caricamento del file XML

# Error_Opening_File
source: The following file could not be read :
de: Die folgende Datei konnte nicht gelesen werden…
fr: Le fichier suivant ne peut être lu :
it: Impossibile leggere il file:

# Error_Opening_File_Tile
source: Unable to open file...
de: Datei konnte nicht geöffnet werden…
fr: Impossible d'ouvrir le fichier
it: Impossibile aprire il file...

source: Error saving to file...
de: Fehler beim Speichern der Datei…
fr: Erreur à la sauvegarde du fichier…
it: Errore durante il salvataggio del file...

# Error_Saving_To_File_Message
source: Make sure the file is not read-only and that you have the appropriate permissions to access it.
de: Stellen Sie sicher, dass die Datei nicht schreibgeschützt ist und dass Sie die erforderlichen Rechte für den Zugriff besitzen.
fr: Assurez-vous que le fichier n'est pas en lecture seule et que vous avez les permissions nécessaires pour y accéder.
it: Assicuratevi che il file non sia in sola lettura e che abbiate i diritti di accesso.

# Export_SaveTypeFilter
source: Visual Studio Community Content Installer File (*.vsi)|*.vsi
de: Visual Studio Community Content Installer-Datei (*.vsi)|*.vsi
fr: Fichier d'installation de contenu de Visual Studio (*.vsi)|*.vsi

# Export_Snippet_Cancelled
source: export operation cancelled
de: Exportieren wurde abgebrochen
fr: opération d'exportation annulée
it: operazione di export cancellata

# Export_Snippet_Error
source: unable to export snippet to VSI
de: Snippet konnte nicht nach .VSI exportiert werden
fr: impossible d'exporter l'extrait de code dans un VSI
it: impossibile esportare lo snippet to VSI

# Export_Snippet_Success
source: Snippet successfully exported to .VSI
de: Snippet erfolgreich nach .VSI exportiert
fr: Exportation de l'extrait de code dans un VSI réussie
it: Snippet esportato to .VSI con successo

# Export_Title
source: Export snippet to VSI
de: Snippet nach VSI exportieren
fr: Exporter l'extrait de code dans un VSI
it: Exporta snippet in VSI

# Folder_Browser_Description
source: Select Folder to open...
de: Wählen Sie den zu öffnenden Ordner…
fr: Sélectionner le dossier à ouvrir…
it: Seleziona la cartella da aprire...

# Item_Missing_Choice_Explanation
source: Press OK to continue loading or press Cancel to abort.
de: Wählen Sie "OK", um das Laden fortzusetzen, oder "Abbrechen", um abzubrechen.
fr: Appuyer sur OK pour continuer le chargement ou sur Annuler.
it: Premi Ok per continuare il caricamento oppure Cancel per interrompere

source: Language not supported.
de: Speiche wird nicht unterstützt.
fr: Langage non supporté
it: Linguaggio non supportato

# Mnu_Delete
source: Delete
de: Löschen
fr: Supprimer
it: Cancella

# Mnu_Remove
source: Remove
de: Entfernen
fr: Enlever
it: Remuovi

# Msg_Add_Existing_Folder_Prompt
source: Select a folder to add to your snippet collection
de: Wählen Sie einen Ordner aus, der zur Snippet-Sammlung hinzugefügt werden soll
fr: Sélectionner un dossier pour ajouter votre collection d'extrait de code
it: Seleziona una cartella da aggiungere alla collezione di snippets

# Msg_Add_New_Folder_Default
source: MyFolder
fr: MonDossier
it: MiaCartella

# Msg_Add_New_Folder_Prompt
source: Add New Folder
de: Neuen Ordner hinzufügen
fr: Ajouter un nouveau dossier
it: Aggiungi nuova cartella

# Msg_Add_New_Folder_Title
source: Enter a name for the new folder
de: Geben Sie den Namen des neuen Ordners ein
fr: Entrer un nom pour le nouveau dossier
it: Inserisci il nome della nuova cartella

# Msg_Add_New_Snippet_Default
source: NewSnippet
de: Neues Snippet…
fr: Nouvel extrait de code
it: NuovoSnippet

# Msg_Add_New_Snippet_Prompt
source: Enter a name for the new snippet
de: Geben Sie den Namen des neuen Snippets ein
fr: Entrer un nom pour le nouvel extrait de code
it: Inserisci il nome del nuovo snippet

# Msg_Add_New_Snippet_Title
source: Add New Snippet
de: Neues Snippet hinzufügen
fr: Ajouter un nouvel extrait de code
it: Aggiungi nuovo snippet

# Msg_Delete_File_Prompt
source: Warning: This will permanetly remove the snippet from your file system. Are you sure you want to delete this snippet ?
de: Achtung: Damit wird das Snippet endgültig aus dem Dateisystem gelöscht. Sind Sie sicher, dass sie dieses Snippet löschen möchten?
fr: Attention : Ceçi supprimera définitivement le fichier contenant votre extrait de code. Etes-vous sur de vouloir supprimer cet extrait de code ?
it: Attenzione: State per rimuovere completamente lo snippet dal disco. Sei sicuro di volerlo rimuovere?

# Msg_Delete_File_Title
source: Delete Snippet
de: Snippet löschen
fr: Supprimer l'extrait de code
it: Cancella snippet

# Msg_Delete_Folder_Prompt
source: Are you sure you want to delete the folder :
de: Sind Sie sicher, dass Sie den Ordner löschen wollen?
fr: Etes-vous sur de vouloir supprimer le dossier :
it: Sei sicuro di volere cancellare la cartella:

# Msg_Delete_Folder_Title
source: Delete Folder
de: Ordner löschen
fr: Supprimer ce dossier
it: Cancella cartella

# Msg_Remove_Folder_Prompt
source: Are you sure you want to remove from the snippet collection the folder :
de: Sind Sie sicher, dass Sie den Ordner aus der Snippetsammlung entfernen wollen?
fr: Etes-vous sur de vouloir retirer de votre collection d'extrait de code le dossier :
it: Sei sicuro di volere cancellare dalla collezione di snippets la cartella:

# Msg_Remove_Folder_Title
source: Remove Folder
de: Ordner entfernen
fr: Supprimer le dossier
it: Rimuovi cartella

source: NewLiteral
fr: NouvelArgument

source: NewObject
fr: NouvelObjet

source: Open Snippet...
de: Snippet öffnen…
fr: Ouvrir l'extrait de code
it: Apri Snippet...

# OpenSaveTypeFilter
source: Visual Studio Snippets (*.snippet)|*.snippet|All files (*.*)|*.*
de: Visual Studio Snippets (*.snippet)|*.snippet|Alle Dateien (*.*)|*.*
fr: Extrait de code Visual Studio (*.snippet)|*.snippet|Tous les fichiers (*.*)|*.*
it: Visual Studio Snippets (*.snippet)|*.snippet|Tutti i files (*.*)|*.*

source: Save Snippet As...
de: Snippet speichern unter…
fr: Enregistrer l'extrait de code sous
it: Save Snippet come...

# Save_Snippet_Cancelled
source: save operation cancelled
de: Speichern wurde abgebrochen
fr: enregistrement annulé
it: operazione di salvataggio cancellata

# Save_Snippet_Error
source: unable to save snippet
de: Snippet konnte nicht gespeichert werden
fr: impossible de sauvegarder l'extrait de code
it: impossibile salvare lo snippet

# Save_Snippet_Success
source: snippet successfully saved
de: Snippet wurde erfolgreich gespeichert
fr: l'extrait de code a été sauvegardé
it: snippet salvato con successo

# Snippet_Closing1
source: The opened snippet is about to be closed.
de: Das geöffenete Snippet wird geschlossen.
fr: L'extrait de code va être fermé.
it: Lo snippet corrente sta per essere chiuso.

# Snippet_Closing2
source: Do you want to save the changes?
de: Möchten Sie die Änderungen speichern?
fr: Vouez-vous sauvegarder les modifications ?
it: Vuoi salvare le modifiche?

source: Snippet Editor
fr: Editeur d'extrait de code

source: Untitled
de: Unbenannt
fr: SansNom
it: Senza titolo

# Compile_Error
source: Error#
de: Fehler#
fr: Erreur#
it: Errore#

# Compile_Errors
source: Compilation found {0} error(s)
de: {0} Fehler bei der Kompilierung
fr: La compilation a trouvé {0} erreurs
it: La compilazione ha trovato {0} errore(i)

# Compile_Line
source: at line
de: in Zeile
fr: ligne
it: alla line

# Help_Text
source: please see the documentation on gotdotnet
de: Bitte sehen Sie in der Dokumentation auf gotdotnet nach
fr: veuillez voir la documentation sur le gotdotnet
it: consulta la documentazione su gotdotnet

# Welcome_HTML
source: <html> <head> <title>VB Snippet Editor Tips</title> <style type="text/css">blockquote{font-family: Verdana;text-align: justify;}</style> </head> <body> <h3>Quick Start Tips:</h3> <blockquote> <ul> <li>Double click on a snippet in the treeview to <b> edit</b> it<br> &nbsp;</li> <li>To create a <b>new</b> snippet, select the folder you want to add it to, then right click on that folder and select <i>Add New Snippet</i> from the context menu<br> &nbsp;</li> <li>Use the filter to help <b>search</b> for snippets.&nbsp; The filter is cumulative, so you can type in a new word to search for and the previous results will get filtered on the new term.&nbsp; To reset the treeview to display all items, simply clear the filter term then click the apply button (or press Enter)</li> </ul> </blockquote> </body> </html>
de: <html> <head> <meta http-equiv="Content-Language" content="de"> <meta http-equiv="Content-Type" content="text/html; charset=windows-1252"> <title>VB Snippet Editor Tips</title> <style type="text/css">p{font-family: Verdana;font-size: 9pt;text-align: justify;}</style> </head> <body> <h3>Hinweise für den schnellen Einstieg:</h3> <blockquote> <ul> <li>Doppelklicken Sie ein Snippet in der Baumansicht, um es zu <b>bearbeiten</b>.<br> &nbsp;</li> <li>Um ein <b>neues</b> Snippet zu erstellen, wählen Sie den Ordner aus, dem es hinzugefügt werden soll, klicken Sie den Ordner mit der rechten Maustaste an und wählen Sie <i>Neues Snippet hinzufügen</i> aus dem Kontextmenü.<br> &nbsp;</li> <li>Die <b>Suche</b> nach Snippets kann über Filter vereinfacht werden. Der Filter ist kumulativ, d.h., es kann ein neuer Suchbegriff eingegeben werden, nach dem die bisherigen Suchergebnisse gefiltert werden. Um die Baumansicht zurückzusetzen, sodass alle Einträge angezeigt werden, löschen Sie einfach den Filterausdruck und klicken auf die Schaltfläche <i>Übernehmen</i> (oder drücken die Eingabetaste).</li> </ul> </blockquote> </body> </html>
fr: <html> <head> <meta http-equiv="Content-Language" content="fr"> <meta http-equiv="Content-Type" content="text/html; charset=windows-1252"> <title>VB Snippet Editor Tips</title> <style type="text/css">p{font-family: Verdana;font-size: 9pt;text-align: justify;}</style> </head> <body> <h3>Aide rapide :</h3> <blockquote> <ul> <li>Double cliquez sur un extrait de code dans l'arborescence pour l'<b> éditer</b><br> &nbsp;</li> <li>Pour créer un <b>nouvel</b> extrait de code, sélectionnez le dossier ou vous voulez l'ajouter puis, clic droit sur ce dossier et sélectionner <i>Ajouter un nouvel extrait de code</i> dans le menu contextuel<br> &nbsp;</li> <li>Utiliser le filtrer pour vous aider dans vos <b>recherches</b> d'extrait de code. Le filtre est cumulatif donc vous pouvez entrer un nouveau mot clé pour affiner vos recherches. Pour remettre à zéro le filtre, supprimer tous vos mots clés et cliquez sur le bouton Appliquer (ou appuyez sur Entrer)</li> </ul> </blockquote> </body> </html>
it: <html> <head> <title>VB Snippet Editor Tips</title> <meta http-equiv="Content-Language" content="en-au"> <meta http-equiv="Content-Type" content="text/html; charset=windows-1252"> </head> <body> <h3>Qualche tip per iniziare:</h3> <blockquote> <ul> <li> Fare doppio click su uno snippet per editarlo<br> &nbsp; <li> Per creare un <STRONG>nuovo</STRONG> snippet, selezionata la cartella alla quale desiderate aggiungerlo, fate click col tasto destro sulla stessa e selezionate <EM>Aggiungi Nuovo Snippet</EM> dal relativo context menu<BR> <li> Usate i filtri per facilitare la ricerca&nbsp;degli snippets. Il filtro e' cumulativo, potete scrivere una nuova parola per cercare all'interno di un insieme di items gia' preventivamente filtrati.&nbsp; Per resettare il filtro e visualizzare tutti gli items nel treeview, cancellate il termine di filtro e premente il pulsante applica (o premete Enter)</li> </ul> </blockquote> </body> </html>

# MyDocs_Snippets_Path
source: \Visual Studio\8.0\Code Snippets\VB\My Code Snippets\
de: \Visual Studio\8.0\Code Snippets\VB\Eigene Code Snippets\
